CHAR_DEFAULT = [
	'<pad>', '<unk>', '<root>', 'a', 'æ', 'á', 'à', 'ả', 'ã', 'ạ', 'ă',
	'ǎ', 'ắ', 'ằ', 'ẳ', 'ẵ', 'ặ', 'â', 'ấ', 'ầ', 'ẩ', 'ẫ', 'ậ', 'b', 'c',
	'd', 'đ', 'e', 'é', 'è', 'ẻ', 'ẽ', 'ẹ', 'ê', 'ế', 'ề', 'ể', 'ễ', 'ệ',
	'f', 'g', 'h', 'i', 'í', 'ï', 'ỉ', 'î', 'ĩ', 'ị', 'ٱ', 'ì', 'j', 'k',
	'l', 'm', 'n', 'o', 'ö', 'ó', 'ò', 'ỏ', 'õ', 'ọ', 'ô', 'ố', 'ồ', 'ổ',
	'ỗ', 'ộ', 'ơ', 'ớ', 'ờ', 'ở', 'ỡ', 'ợ', 'p', 'q', 'r', 's', 't', 'µ',
	'u', 'ú', 'ù', 'ü', 'ủ', 'ũ', 'ụ', 'ư', 'ứ', 'ừ', 'ửữ', 'ự', 'v', 'w',
	'x', 'y', 'ý', 'ỳ', 'ỹ', 'ỷ', 'ỵ', 'z', '0', '+', '-', '^', '*', '/',
	'\\', '~', '=', "'", '`', '"', '(', ')', '[', ']', '{', '}', '|', '<',
	'>', '‘', '’', ',', '.', '–', '_', '#', '%', '&', ':', ';', '?', '!',
	'@', '©', '®', '$', '°', '•', '℃', 'ð', '¼', '‰', '́', 'L', 'T', 'K',
	'D', 'N', 'V', 'C', 'P', 'ử', 'H', 'S', 'ữ', 'Đ', 'B', 'M', 'Q', 'G',
	'O', 'A', 'Ô', 'U', 'E', 'F', 'X', 'R', 'W', 'Z', 'J', 'Ð', 'Ở', 'Ú',
	'Ấ', 'Ả', 'Y', 'I', 'Â', 'Á', 'Ẩ', 'Ý', 'Ư', 'Ờ', 'Ă', 'Ơ', 'Í', 'Ầ',
	'Ừ', 'Ố', 'À', 'Ê', 'Ồ', 'Ủ', 'Ù', 'Ạ', 'Ợ', 'Ặ', 'Ề', 'Ì', 'Ự', 'Ổ',
	'Ị', 'Ũ', 'Ã', 'Ĩ', 'Ể', 'Ằ', 'Ộ', 'È', 'Ệ', 'Ễ', 'Ỉ', 'Ỹ', 'Ậ', 'Ế',
	'Ỗ', 'Ỳ', 'Ẫ', 'Ọ', 'Ớ', 'Ẹ', 'Ứ', 'Ò', 'Ỏ', 'Ụ', 'Ữ', 'Ẻ', 'Ử', 'Õ',
	'Ó', 'Ắ', 'Ẽ', 'É', 'Ỷ', '½', '±', 'Ỡ', '¾', '̣', 'Ẵ', '̀', '\uf0fc', 'Ẳ',
	'ø', 'å', '\u200e', '►', '€', 'а', '»', 'ç', 'Ü', 'Æ', 'Ö', '²', '—',
	'™', 'ñ', 'û', 'ä', 'Ω'
]

PAD_TOKEN = '<pad>'
PAD_INDEX = 0

UNK_TOKEN = '<unk>'
UNK_INDEX = 1

ROOT_TOKEN = '<root>'
ROOT_TAG = 'ROOT'
ROOT_LABEL = '_root_'
ROOT_INDEX = 2

# 1 contain number, 2 lowercase, 3 uppercase
def word_format(word, position):
	# upper is normal at start of sentence
	if word[0].isupper() and position > 1:
		return 1
	for char in word:
		if char.isdigit():
			return -1
	return 0
